#include <stdio.h>
#include <stdlib.h>
#include <conio.h>


int** getMem(int M, int N); // первинне виділення пам'яті
void inpMatr(int** a,int n, int m); // введення з клави
void outMatr(int** a); // виведення на екран
int** chngMem(int **a); // зміна обсягу і структури дин. пам'яті

int main()
{
	int i, j;			// лiчильники рядкґв і стовпчиків
	int** a;			// покажчик на двовимірний масив
    int* p, *p1;		// допоміжні покажчики на ділянки масиву з числами
    int M,N, M1;

	printf("Input num of rows: M=");
	scanf("%d",&M);
	printf("Input num of cols: N=");
	scanf("%d",&N);

   	a=getMem(M,N); // виділення початкового масиву
    M1= sizeof(a);
    printf("\nM = %i\n", M1);
 	for ( i = 0; i < M; i ++ ){
 		*a=(int*)malloc(N*sizeof(int));	 // і під кожен рядок окремо
		printf("a[%i]=%p\n",i,*a++); // стартова адреса - на екран, а++ - покажчик на наст. комірку
	}
 /*  M1= _msize(a)/sizeof(int*);
    a-=M;
	for(i=M-1;i>=1;i--){ // обхід масиву з останнього за номером рядка
		p=*(a+i); // покажчик - на перший елемент і-го рядка
		p1=*(a+i-1); // другий покажчик - на перший елемент сусіднього рядка
		for(j=1; j<=N; j++){ // перебираємо елементи в рядках
			(*p++)*=*p1++; // розіменовуючи покажчики - перемножуємо сусідні елементи одного стовпчика, потім покажчики зсуваємо на комірку вперед
        }
	}*/

}



int** getMem(int M, int N )
{
	int **a;
	int i;

	a=(int**)malloc(M*sizeof(int*)); // виділ. пам'ять під масив покажчиків

 	for ( i = 0; i < M; i ++ ){
 		*a=(int*)malloc(N*sizeof(int));	 // і під кожен рядок окремо
		printf("a[%i]=%p\n",i,*a++); // стартова адреса - на екран, а++ - покажчик на наст. комірку
	}
    a-=M; // після фіксації адрес усіх рядків - покажчик на початкову позицію

    return a; // повертаємо адресу в місце виклику функції
}


