#include <stdio.h>

main()
{
	int n, x, y, sum;
	FILE *fin, *fout; 	// оголошуємо два покажчики, оскільки одночасно доведеться працювати з двома файлами

	fin = fopen( "input.dat", "r" ); // відкрити файл на читання
	fout = fopen( "output.dat", "w" ); // відкрити файл на запис
	… 	// перевіка на відсутність помилок при відкритті файлів
	while ( 1 ) { 		// цикл до примусового виходу з нього
		n = fscanf ( fin, "%d%d", &x, &y );	// зчитуємо з файлу input.dat пару чисел, при цьому фіксуємо кількість вдало зчитаних чисел
		if ( n < 2 ) break; 	// якщо вдало зчитано менше, ніж 2 числа (кінець файлу або натрапили на некоректні дані) - примусовий вихід з циклу
		sum = x + y;		// знаходимо суму зчитаної пари
		fprintf ( fout, "%d\n", sum ); // результат вносимо у файл output.dat
	}
	fclose ( fout ); // закриваємо
	fclose ( fin );    // обидва файли
}
